kafka/gce/bench-results.bak/direct/2016-07-11.08-55/producers/client-1.log
2016:07:11 06:56:16,1505 records sent, 300.9 records/sec (29.39 MB/sec), 14.4 ms avg latency, 333.0 max latency.
2016:07:11 06:56:21,1521 records sent, 304.1 records/sec (29.70 MB/sec), 3.8 ms avg latency, 66.0 max latency.
2016:07:11 06:56:26,1502 records sent, 300.3 records/sec (29.32 MB/sec), 2.7 ms avg latency, 63.0 max latency.
2016:07:11 06:56:31,1515 records sent, 302.9 records/sec (29.58 MB/sec), 2.0 ms avg latency, 38.0 max latency.
2016:07:11 06:56:36,1481 records sent, 296.1 records/sec (28.92 MB/sec), 2.4 ms avg latency, 40.0 max latency.
2016:07:11 06:56:41,1508 records sent, 301.5 records/sec (29.44 MB/sec), 2.2 ms avg latency, 40.0 max latency.
2016:07:11 06:56:46,1531 records sent, 306.1 records/sec (29.90 MB/sec), 2.1 ms avg latency, 39.0 max latency.
2016:07:11 06:56:51,1527 records sent, 305.4 records/sec (29.82 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 06:56:56,1514 records sent, 302.8 records/sec (29.57 MB/sec), 18.1 ms avg latency, 332.0 max latency.
2016:07:11 06:57:01,1522 records sent, 304.3 records/sec (29.72 MB/sec), 2.1 ms avg latency, 39.0 max latency.
2016:07:11 06:57:06,1528 records sent, 305.5 records/sec (29.84 MB/sec), 2.0 ms avg latency, 39.0 max latency.
2016:07:11 06:57:11,1508 records sent, 301.5 records/sec (29.45 MB/sec), 23.4 ms avg latency, 402.0 max latency.
2016:07:11 06:57:16,1524 records sent, 304.7 records/sec (29.75 MB/sec), 2.1 ms avg latency, 37.0 max latency.
2016:07:11 06:57:21,1529 records sent, 305.7 records/sec (29.86 MB/sec), 2.0 ms avg latency, 41.0 max latency.
2016:07:11 06:57:26,1528 records sent, 305.4 records/sec (29.83 MB/sec), 2.3 ms avg latency, 40.0 max latency.
2016:07:11 06:57:31,1515 records sent, 302.9 records/sec (29.58 MB/sec), 2.2 ms avg latency, 38.0 max latency.
2016:07:11 06:57:36,1504 records sent, 300.6 records/sec (29.36 MB/sec), 2.3 ms avg latency, 44.0 max latency.
2016:07:11 06:57:41,1497 records sent, 299.4 records/sec (29.24 MB/sec), 12.2 ms avg latency, 266.0 max latency.
2016:07:11 06:57:46,1523 records sent, 304.6 records/sec (29.75 MB/sec), 11.2 ms avg latency, 256.0 max latency.
2016:07:11 06:57:51,1539 records sent, 307.7 records/sec (30.05 MB/sec), 1.8 ms avg latency, 38.0 max latency.
2016:07:11 06:57:56,1513 records sent, 302.6 records/sec (29.55 MB/sec), 2.3 ms avg latency, 38.0 max latency.
2016:07:11 06:58:01,1531 records sent, 306.2 records/sec (29.90 MB/sec), 2.6 ms avg latency, 66.0 max latency.
2016:07:11 06:58:06,1516 records sent, 303.0 records/sec (29.59 MB/sec), 2.2 ms avg latency, 38.0 max latency.
2016:07:11 06:58:11,1533 records sent, 306.6 records/sec (29.94 MB/sec), 1.8 ms avg latency, 36.0 max latency.
2016:07:11 06:58:16,1529 records sent, 305.7 records/sec (29.85 MB/sec), 3.0 ms avg latency, 69.0 max latency.
2016:07:11 06:58:21,1517 records sent, 303.4 records/sec (29.63 MB/sec), 15.7 ms avg latency, 321.0 max latency.
2016:07:11 06:58:26,1535 records sent, 306.9 records/sec (29.97 MB/sec), 2.0 ms avg latency, 41.0 max latency.
2016:07:11 06:58:31,1527 records sent, 305.3 records/sec (29.82 MB/sec), 2.2 ms avg latency, 42.0 max latency.
2016:07:11 06:58:36,1524 records sent, 304.7 records/sec (29.76 MB/sec), 16.0 ms avg latency, 332.0 max latency.
2016:07:11 06:58:41,1535 records sent, 306.8 records/sec (29.96 MB/sec), 1.8 ms avg latency, 38.0 max latency.
2016:07:11 06:58:46,1530 records sent, 306.0 records/sec (29.88 MB/sec), 2.1 ms avg latency, 42.0 max latency.
2016:07:11 06:58:51,1539 records sent, 307.7 records/sec (30.05 MB/sec), 2.4 ms avg latency, 59.0 max latency.
2016:07:11 06:58:56,1536 records sent, 307.2 records/sec (30.00 MB/sec), 2.0 ms avg latency, 35.0 max latency.
2016:07:11 06:59:01,1541 records sent, 308.1 records/sec (30.09 MB/sec), 1.8 ms avg latency, 37.0 max latency.
2016:07:11 06:59:06,1524 records sent, 304.7 records/sec (29.76 MB/sec), 2.1 ms avg latency, 38.0 max latency.
2016:07:11 06:59:11,1530 records sent, 305.8 records/sec (29.86 MB/sec), 3.8 ms avg latency, 71.0 max latency.
2016:07:11 06:59:16,1524 records sent, 304.7 records/sec (29.75 MB/sec), 4.6 ms avg latency, 83.0 max latency.
2016:07:11 06:59:21,1528 records sent, 305.4 records/sec (29.83 MB/sec), 9.5 ms avg latency, 118.0 max latency.
2016:07:11 06:59:26,1517 records sent, 303.4 records/sec (29.63 MB/sec), 27.2 ms avg latency, 274.0 max latency.
2016:07:11 06:59:31,1457 records sent, 291.3 records/sec (28.45 MB/sec), 390.3 ms avg latency, 1204.0 max latency.
2016:07:11 06:59:36,1506 records sent, 301.1 records/sec (29.40 MB/sec), 28.4 ms avg latency, 156.0 max latency.
2016:07:11 06:59:41,1506 records sent, 301.1 records/sec (29.40 MB/sec), 11.0 ms avg latency, 173.0 max latency.
2016:07:11 06:59:46,1231 records sent, 246.1 records/sec (24.03 MB/sec), 605.5 ms avg latency, 2012.0 max latency.
2016:07:11 06:59:51,1527 records sent, 305.3 records/sec (29.82 MB/sec), 6.3 ms avg latency, 88.0 max latency.
2016:07:11 06:59:56,1553 records sent, 310.6 records/sec (30.33 MB/sec), 14.8 ms avg latency, 202.0 max latency.
2016:07:11 07:00:01,1513 records sent, 302.4 records/sec (29.53 MB/sec), 53.1 ms avg latency, 357.0 max latency.
2016:07:11 07:00:06,1529 records sent, 305.7 records/sec (29.86 MB/sec), 4.5 ms avg latency, 67.0 max latency.
2016:07:11 07:00:11,1522 records sent, 304.4 records/sec (29.73 MB/sec), 5.4 ms avg latency, 116.0 max latency.
2016:07:11 07:00:16,1519 records sent, 303.7 records/sec (29.66 MB/sec), 10.7 ms avg latency, 251.0 max latency.
2016:07:11 07:00:21,1518 records sent, 303.5 records/sec (29.64 MB/sec), 2.0 ms avg latency, 43.0 max latency.
2016:07:11 07:00:26,1540 records sent, 308.0 records/sec (30.08 MB/sec), 1.8 ms avg latency, 36.0 max latency.
2016:07:11 07:00:31,1526 records sent, 305.1 records/sec (29.79 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 07:00:36,1520 records sent, 303.9 records/sec (29.68 MB/sec), 14.6 ms avg latency, 313.0 max latency.
2016:07:11 07:00:42,1521 records sent, 304.1 records/sec (29.70 MB/sec), 2.0 ms avg latency, 42.0 max latency.
2016:07:11 07:00:47,1521 records sent, 304.1 records/sec (29.70 MB/sec), 2.0 ms avg latency, 44.0 max latency.
2016:07:11 07:00:52,1526 records sent, 305.1 records/sec (29.79 MB/sec), 3.1 ms avg latency, 76.0 max latency.
2016:07:11 07:00:57,1536 records sent, 307.2 records/sec (30.00 MB/sec), 2.9 ms avg latency, 78.0 max latency.
2016:07:11 07:01:02,1496 records sent, 299.2 records/sec (29.22 MB/sec), 2.4 ms avg latency, 38.0 max latency.
2016:07:11 07:01:07,1524 records sent, 304.7 records/sec (29.75 MB/sec), 2.4 ms avg latency, 58.0 max latency.
2016:07:11 07:01:12,1534 records sent, 306.7 records/sec (29.95 MB/sec), 18.1 ms avg latency, 353.0 max latency.
2016:07:11 07:01:17,1501 records sent, 300.1 records/sec (29.30 MB/sec), 3.9 ms avg latency, 106.0 max latency.
2016:07:11 07:01:22,1473 records sent, 294.5 records/sec (28.76 MB/sec), 1.9 ms avg latency, 36.0 max latency.
2016:07:11 07:01:27,1480 records sent, 296.0 records/sec (28.91 MB/sec), 2.4 ms avg latency, 44.0 max latency.
2016:07:11 07:01:32,1516 records sent, 303.1 records/sec (29.60 MB/sec), 2.2 ms avg latency, 40.0 max latency.
2016:07:11 07:01:37,1519 records sent, 303.8 records/sec (29.67 MB/sec), 1.9 ms avg latency, 39.0 max latency.
2016:07:11 07:01:42,1518 records sent, 303.5 records/sec (29.64 MB/sec), 27.0 ms avg latency, 347.0 max latency.
2016:07:11 07:01:47,1524 records sent, 304.8 records/sec (29.77 MB/sec), 12.7 ms avg latency, 277.0 max latency.
2016:07:11 07:01:52,1526 records sent, 305.1 records/sec (29.80 MB/sec), 1.9 ms avg latency, 40.0 max latency.
2016:07:11 07:01:57,1532 records sent, 306.3 records/sec (29.91 MB/sec), 2.0 ms avg latency, 38.0 max latency.
2016:07:11 07:02:02,1536 records sent, 307.1 records/sec (29.99 MB/sec), 9.9 ms avg latency, 225.0 max latency.
2016:07:11 07:02:07,1528 records sent, 304.8 records/sec (29.77 MB/sec), 1.9 ms avg latency, 39.0 max latency.
2016:07:11 07:02:12,1544 records sent, 308.8 records/sec (30.16 MB/sec), 1.9 ms avg latency, 37.0 max latency.
2016:07:11 07:02:17,1521 records sent, 304.1 records/sec (29.70 MB/sec), 2.2 ms avg latency, 37.0 max latency.
2016:07:11 07:02:22,1538 records sent, 307.5 records/sec (30.03 MB/sec), 15.9 ms avg latency, 337.0 max latency.
2016:07:11 07:02:27,1540 records sent, 308.0 records/sec (30.08 MB/sec), 1.8 ms avg latency, 44.0 max latency.
2016:07:11 07:02:32,1540 records sent, 307.9 records/sec (30.07 MB/sec), 16.2 ms avg latency, 330.0 max latency.
2016:07:11 07:02:37,1534 records sent, 306.7 records/sec (29.95 MB/sec), 9.8 ms avg latency, 243.0 max latency.
2016:07:11 07:02:42,1535 records sent, 306.9 records/sec (29.97 MB/sec), 1.8 ms avg latency, 38.0 max latency.
2016:07:11 07:02:47,1540 records sent, 307.9 records/sec (30.07 MB/sec), 1.9 ms avg latency, 37.0 max latency.
2016:07:11 07:02:52,1534 records sent, 306.7 records/sec (29.95 MB/sec), 2.1 ms avg latency, 37.0 max latency.
2016:07:11 07:02:57,1541 records sent, 308.2 records/sec (30.10 MB/sec), 2.0 ms avg latency, 38.0 max latency.
2016:07:11 07:03:02,1512 records sent, 302.3 records/sec (29.52 MB/sec), 1.9 ms avg latency, 37.0 max latency.
2016:07:11 07:03:07,126000 records sent, 303.396597 records/sec (29.63 MB/sec), 16.85 ms avg latency, 2012.00 ms max latency, 2 ms 50th, 33 ms 95th, 317 ms 99th, 1783 ms 99.9th.